{
    "total_size": 5,
    "type_id": 3,
    "offset": 0,
    "products": [
        {
            "id": 1,
            "name": "ข้าวโพดเลี้ยงสัตว์",
            "description": "ข้าวโพดเลี้ยงสัตว์นับว่าเป็นพืชไร่ชนิดหนึ่งที่มีศักยภาพที่จะใช้ปลูกในฤดูแล้งหลังเก็บเกี่ยวข้าว เนื่องจากเป็นพืชที่ใช้น้ำน้อยกว่าการทำนาประมาณ 2-3 เท่า นอกจากนี้ยังช่วยลดการแพร่ระบาดของแมลง คุณภาพเมล็ดดีปราศจากสารพิษแอฟลาทอกซิน ราคาดีและช่วยเพิ่มปริมาณการผลิตให้เพียงพอต่อความต้องการภายในประเทศโดยเฉพาะใช้ในอุตสาหกรรมอาหารสัตว์",
            "price": 8000,
            "stars": 3,
            "img": "https://raw.githubusercontent.com/Khanthamalee/Ecommercefromflutter/main/fontend/ecommerce/assets/image_ui/corn.png",
            "location": "Moraine Lake, Alberta",
            "created_at": "2021-11-17 10:16:31",
            "updated_at": "2022-05-16 11:49:24",
            "type_id": 3
        },
        {
            "id": 2,
            "name": "เป็ดเทศ",
            "description": "เป็ดเทศ (Muscovy) พบครั้งแรกในทวีปอเมริกาใต้ เป็นเป็ดอีกพันธุ์หนึ่งต่างหาก เป็นเป็ดที่ให้เนื้อมากแต่ให้ไข่น้อยและโตค่อนข้างช้า ตัวเมียมีนิสัยชอบฟักไข่และเลี้ยงลูกเก่ง เมื่อโตเต็มที่ตัวผู้จะมีน้้าหนักประมาณ 4-4.5 กิโลกรัม ตัวเมียจะมีน้้าหนักประมาณ 3.0-3.5 กิโลกรัม เนื่องจากเป็นเป็ดที่โตช้าและตัวผู้กับตัวเมียมีน้้าหนักแตกต่างกันมากจึงไม่ค่อยมีผู้นิยมเลี้ยงเป็นการค้า อย่างไรก็ตามเมื่อน้ามาผสมพันธุ์กับเป็ดพันธุ์อื่นจะให้ลูกเป็นหมันแต่มีอัตราการเจริญเติบโตดีขึ้นและความแตกต่างของน้้าหนักตัวระหว่างเพศผู้และเพศเมียจะน้อยลง เช่น เป็ดพันธุ์ปั๊วฉ่าย (Mule duck)เป็ดเทศที่พบในประเทศไทยมี 2 สี ได้แก่ ชนิดที่มีสีขาว และชนิดที่มีสีด้า ทั้ง 2 ชนิด ที่บริเวณใบหน้าและเหนือจมูกมีหนังย่นสีแดง เป็ดเทศชนิดที่มีสีขาวจะมีขนสีขาว ผิวหนังสีขาวแข้งสีเหลืองส้มอ่อน ปากมีสีเนื้อ ส่วนชนิดที่มีสีด้าจะมีขนที่หน้าอก ล้าตัวและหลังสีด้าประขาว ปากสีชมพู แข้งสีเหลืองหรือตะกั่วเข้ม ",
            "price": 550,
            "stars": 4,
            "img": "https://raw.githubusercontent.com/Khanthamalee/Ecommercefromflutter/main/fontend/ecommerce/assets/image_ui/duck.png",
            "location": "Killarney Provincial Park",
            "created_at": "2021-11-17 10:18:46",
            "updated_at": "2022-01-01 08:55:05",
            "type_id": 3
        },
        {
            "id": 3,
            "name": "กล้วยน้ำหว้า",
            "description": "เป็นพืชล้มลุก มีลำต้นใต้ดิน (rhizome) เรียกว่าเหง้า และแตกหน่อออกด้านข้าง อายุได้หลายปี ลำต้นบนดิน คือส่วนกาบใบที่เรียงเวียนซ้อนกันเป็นลำต้นเทียมมีสีสีเขียวและมีปื้นดำเล็กน้อย ด้านในสีเขียวอ่อน รูปทรงกระบอก สูง 2-9 เมตร /nใบ เป็นใบเดี่ยวขนาดใหญ่ กว้าง 0.7-1.0 เมตร ออกเรียงเวียนสลับกัน ลักษณะใบรูปขอบขนานแกมรูปไข่ โคนใบมนหรือเฉียง ขอบใบเรียบ และมีแถบสีแดงเล็กโดยรอบ ปลายใบแหลมหรือเรียวแหลม แผ่นใบยาวสีเขียว ท้องใบหรือใต้ใบสีขาวนวล เส้นกลางใบหรือแกนใบเป็นร่องลึกแข็งเห็นชัดเจน เส้นใบมีจำนวนมาก แยกออกจากเส้นกลางใบทั้งสองข้าง ขนานกันไปจดขอบใบ ก้านใบมีลักษณะเป็นเนื้อเยื่อตรงกลางเป็นรูพรุน ยาว 1-2 เมตร ส่วนโคนแผ่ออกเป็นกาบ /nดอก เป็นช่อห้อยลง เรียกหัวปลี ยาว 30-150 ซม. ก้านดอกช่อแข็ง ดอกย่อยแยกเป็นดอกเพศผู้ และเพศเมีย ดอกเพศเมียมักอยู่ตอนล่างของช่อ ดอกย่อยเป็นกลุ่มๆ เป็นช่อดอกย่อย แต่ละกลุ่มรองรับด้วยใบประดับขนาดใหญ่สีม่วงแดง ซึ่งติดบนแกนกลางช่อ ดอกแบบเรียงเวียนสลับกัน ดอกย่อยมีขนาดใหญ่ รูปทรงกระบอก กลีบดอกแยกออกเป็น 3-5 แฉก เกสรตัวผู้ที่สมบูรณ์มี 5 อัน ก้านเกสรตัวผู้แข็ง อับเรณูรูปขอบขนาน มี 2 พู รังไข่ติดอยู่ได้ กลีบดอกมี 3 ช่อง แต่ละช่องมีไข่อ่อนจำนวนมากติดรอยเชื่อมของแต่ละช่อง เกสรตัวเมียเป็นเส้นด้าย ยอดเกสรตัวเมียค่อนข้างกลม มี 6 พู /nผล ลักษณะรูปรี ผิวเรียบ ปลายเป็นจุก ออกผลเป็นแผงเรียกว่าหวี และเรียงซ้อนกันหลายหวี เรียกว่า เครือ ผลดิบมีสีเขียว เมื่อสุกมีรสหวาน มีสีเหลือง เนื้อในสีขาวหรือขาวอมเหลือง รับประทานได้ /nเมล็ด ไม่มี หรือ มีแต่น้อย ค่อนข้างกลม สีดำ ",
            "price":200,
            "stars": 5,
            "img": "https://raw.githubusercontent.com/Khanthamalee/Ecommercefromflutter/main/fontend/ecommerce/assets/image_ui/banana.jpg",
            "location": "China",
            "created_at": "2021-12-08 12:29:53",
            "updated_at": "2022-01-01 08:55:44",
            "type_id": 3
        },
        {
           "id": 4,
            "name": "สบู่น้ำผึ้ง",
            "description": "เหลืองใสๆ กลีเซอรีนผสมน้ำผึ้ง ทำให้ผิวยังชุ่มชื้นหลังอาบ /nใช้ส่วนผสมธรรมชาติในการทำสบู่ ใช้กลีเซอรีน ไม่ใช้โซดาไฟผสม กลีเซอรีนที่ใช้ ทำจากน้ำมันเมล็ดในปาล์มขจัดความมัน ไม่มีสารพาราเบน ไม่มีน้ำหอม ไม่มีสาร ",
            "price": 55,
            "stars": 4,
            "img": "https://raw.githubusercontent.com/Khanthamalee/Ecommercefromflutter/main/fontend/ecommerce/assets/image_ui/soup.jpg",
            "location": "china",
            "created_at": "2021-12-26 01:36:29",
            "updated_at": "2022-01-01 08:57:01",
            "type_id": 3
        },
        {
            "id": 5,
            "name": "ปลานิล",
            "description": "ปลานิลสามารถอาศัยอยู่ได้ในน้ำจืดและน้ำกร่อย มีถิ่นกำเนิดเดิมอยู่ที่แม่น้ำไนล์ ทวีปแอฟริกา พบทั่วไปตามหนอง บึง และทะเลสาบในประเทศซูดาน, ยูกันดา และทะเลสาบแทนกันยีกา ปลานิลนำเข้าสู่ประเทศไทยครั้งแรกโดยสมเด็จพระจักรพรรดิอะกิฮิโตะ เมื่อครั้งดำรงพระอิสริยยศมกุฎราชกุมารแห่งญี่ปุ่น ซึ่งทรงจัดส่งเข้ามาทูลเกล้าฯ ถวายพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช เมื่อวันที่ 25 มีนาคม พ.ศ. 2508 จำนวน 50 ตัว ครั้งนั้นได้โปรดเกล้าฯ ให้ทดลองเลี้ยงปลานิลในบ่อนํ้าภายในสวนจิตรลดา เป็นหนึ่งโครงการในโครงการส่วนพระองค์ สวนจิตรลดา",
            "price": 80,
            "stars": 4,
            "img": "https://raw.githubusercontent.com/Khanthamalee/Ecommercefromflutter/main/fontend/ecommerce/assets/image_ui/tilapia.png",
            "location": "BD",
            "created_at": "2021-12-27 06:27:38",
            "updated_at": "2022-01-01 08:57:16",
            "type_id": 3
        }
    ]
}